# 1
print("Архітектор хоче побудувати піраміду з каменів 🧱!")
h = input("Висота піраміди:")
if h.isdigit():
    h = int(h)
    if h > 0:
        for i in range(h):
            print(" " * 3 * (h - i) + "🧱" * (i + 1))
        print("Піраміда готова! Архітектор вдячний за допомогу!")
    else:
        print("Піраміда не може бути висотою 0!")
else:
    print("Для точності потрібно ввести просто число!")

# 2
h = input("Висота клумби:")
w = input("Ширина клумби:")
if h.isdigit() and w.isdigit():
    h, w = int(h), int(w)
    if h > 0 and w > 0:
        for i in range(h):
            if i == 0 or i == (h - 1):
                print(w * "🧱")
            else:
                print("🧱" + (w - 2) * "🌹" + "🧱")
        print("Клумба готова! Архітектор пишається вашою роботою!")
    else:
        print("Клумба не може бути із розмірами 0!")
else:
    print("Розміри клумби мають бути числами!")

# 3
print("Архітектор хоче побудувати план готелю 🏨 з цеглинок 🧱!")
sp = "🟰"

p = int(input("Поверхи:"))
r = int(input("Кімнати:"))
s = int(input("Розмір:"))
for i in range(p):
    print(s * r *"🧱")
    print(r*("🧱"+(s-2)*sp+"🧱"))
    print(s * r *"🧱")
print("План готелю готовий! Архітектор задоволений результатом!")
